Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_NETC_SW_ENETC.h
#define NETC_SW_ENETC_UFMESR0_MEM_ID_MASK        (0x1F0000U)
#define NETC_SW_ENETC_UFMESR0_MEM_ID_SHIFT       (16U)
/*! MEM_ID - Memory ID */
#define NETC_SW_ENETC_UFMESR0_MEM_ID(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFMESR0_MEM_ID_SHIFT)) & NETC_SW_ENETC_UFMESR0_MEM_ID_MASK)

#define NETC_SW_ENETC_UFMESR0_M_MASK             (0x40000000U)
#define NETC_SW_ENETC_UFMESR0_M_SHIFT            (30U)
/*! M - Multiple */
#define NETC_SW_ENETC_UFMESR0_M(x)               (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFMESR0_M_SHIFT)) & NETC_SW_ENETC_UFMESR0_M_MASK)

#define NETC_SW_ENETC_UFMESR0_MBEE_MASK          (0x80000000U)
#define NETC_SW_ENETC_UFMESR0_MBEE_SHIFT         (31U)
/*! MBEE - Multi-bit ECC error */
#define NETC_SW_ENETC_UFMESR0_MBEE(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFMESR0_MBEE_SHIFT)) & NETC_SW_ENETC_UFMESR0_MBEE_MASK)
/*! @} */

/*! @name UFMESR1 - Uncorrectable fatal memory error status register 1 */
/*! @{ */

#define NETC_SW_ENETC_UFMESR1_ADDR_MASK          (0xFFFFFFFFU)
#define NETC_SW_ENETC_UFMESR1_ADDR_SHIFT         (0U)
/*! ADDR - Address */
#define NETC_SW_ENETC_UFMESR1_ADDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_UFMESR1_ADDR_SHIFT)) & NETC_SW_ENETC_UFMESR1_ADDR_MASK)
/*! @} */

/*! @name IMDIOIRR - Internal MDIO interrupt reason register */
/*! @{ */

#define NETC_SW_ENETC_IMDIOIRR_PORT0_MASK        (0x1U)
#define NETC_SW_ENETC_IMDIOIRR_PORT0_SHIFT       (0U)
#define NETC_SW_ENETC_IMDIOIRR_PORT0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IMDIOIRR_PORT0_SHIFT)) & NETC_SW_ENETC_IMDIOIRR_PORT0_MASK)

#define NETC_SW_ENETC_IMDIOIRR_PORT1_MASK        (0x2U)
#define NETC_SW_ENETC_IMDIOIRR_PORT1_SHIFT       (1U)
#define NETC_SW_ENETC_IMDIOIRR_PORT1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IMDIOIRR_PORT1_SHIFT)) & NETC_SW_ENETC_IMDIOIRR_PORT1_MASK)

#define NETC_SW_ENETC_IMDIOIRR_PORT2_MASK        (0x4U)
#define NETC_SW_ENETC_IMDIOIRR_PORT2_SHIFT       (2U)
#define NETC_SW_ENETC_IMDIOIRR_PORT2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IMDIOIRR_PORT2_SHIFT)) & NETC_SW_ENETC_IMDIOIRR_PORT2_MASK)

#define NETC_SW_ENETC_IMDIOIRR_PORT3_MASK        (0x8U)
#define NETC_SW_ENETC_IMDIOIRR_PORT3_SHIFT       (3U)
#define NETC_SW_ENETC_IMDIOIRR_PORT3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IMDIOIRR_PORT3_SHIFT)) & NETC_SW_ENETC_IMDIOIRR_PORT3_MASK)

#define NETC_SW_ENETC_IMDIOIRR_PORT4_MASK        (0x10U)
#define NETC_SW_ENETC_IMDIOIRR_PORT4_SHIFT       (4U)
#define NETC_SW_ENETC_IMDIOIRR_PORT4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IMDIOIRR_PORT4_SHIFT)) & NETC_SW_ENETC_IMDIOIRR_PORT4_MASK)
/*! @} */

/*! @name IMDIOMSIVR - Internal MDIO MSI-X vector register */
/*! @{ */

#define NETC_SW_ENETC_IMDIOMSIVR_VECTOR_MASK     (0x3FU)  /* Merged from fields with different position or width, of widths (4, 6), largest definition used */
#define NETC_SW_ENETC_IMDIOMSIVR_VECTOR_SHIFT    (0U)
#define NETC_SW_ENETC_IMDIOMSIVR_VECTOR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_IMDIOMSIVR_VECTOR_SHIFT)) & NETC_SW_ENETC_IMDIOMSIVR_VECTOR_MASK)  /* Merged from fields with different position or width, of widths (4, 6), largest definition used */
/*! @} */

/*! @name EMDIOIRR - External MDIO interrupt reason register */
/*! @{ */

#define NETC_SW_ENETC_EMDIOIRR_PORT0_MASK        (0x1U)
#define NETC_SW_ENETC_EMDIOIRR_PORT0_SHIFT       (0U)
#define NETC_SW_ENETC_EMDIOIRR_PORT0(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EMDIOIRR_PORT0_SHIFT)) & NETC_SW_ENETC_EMDIOIRR_PORT0_MASK)

#define NETC_SW_ENETC_EMDIOIRR_PORT1_MASK        (0x2U)
#define NETC_SW_ENETC_EMDIOIRR_PORT1_SHIFT       (1U)
#define NETC_SW_ENETC_EMDIOIRR_PORT1(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EMDIOIRR_PORT1_SHIFT)) & NETC_SW_ENETC_EMDIOIRR_PORT1_MASK)

#define NETC_SW_ENETC_EMDIOIRR_PORT2_MASK        (0x4U)
#define NETC_SW_ENETC_EMDIOIRR_PORT2_SHIFT       (2U)
#define NETC_SW_ENETC_EMDIOIRR_PORT2(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EMDIOIRR_PORT2_SHIFT)) & NETC_SW_ENETC_EMDIOIRR_PORT2_MASK)

#define NETC_SW_ENETC_EMDIOIRR_PORT3_MASK        (0x8U)
#define NETC_SW_ENETC_EMDIOIRR_PORT3_SHIFT       (3U)
#define NETC_SW_ENETC_EMDIOIRR_PORT3(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EMDIOIRR_PORT3_SHIFT)) & NETC_SW_ENETC_EMDIOIRR_PORT3_MASK)

#define NETC_SW_ENETC_EMDIOIRR_PORT4_MASK        (0x10U)
#define NETC_SW_ENETC_EMDIOIRR_PORT4_SHIFT       (4U)
#define NETC_SW_ENETC_EMDIOIRR_PORT4(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EMDIOIRR_PORT4_SHIFT)) & NETC_SW_ENETC_EMDIOIRR_PORT4_MASK)
/*! @} */

/*! @name EMDIOMSIVR - External MDIO MSI-X vector register */
/*! @{ */

#define NETC_SW_ENETC_EMDIOMSIVR_VECTOR_MASK     (0x3FU)  /* Merged from fields with different position or width, of widths (4, 6), largest definition used */
#define NETC_SW_ENETC_EMDIOMSIVR_VECTOR_SHIFT    (0U)
#define NETC_SW_ENETC_EMDIOMSIVR_VECTOR(x)       (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_EMDIOMSIVR_VECTOR_SHIFT)) & NETC_SW_ENETC_EMDIOMSIVR_VECTOR_MASK)  /* Merged from fields with different position or width, of widths (4, 6), largest definition used */
/*! @} */

/*! @name TCCR - Time capture configuration register */
/*! @{ */

#define NETC_SW_ENETC_TCCR_TIMEOUT_MASK          (0xFFFFFFU)
#define NETC_SW_ENETC_TCCR_TIMEOUT_SHIFT         (0U)
#define NETC_SW_ENETC_TCCR_TIMEOUT(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCCR_TIMEOUT_SHIFT)) & NETC_SW_ENETC_TCCR_TIMEOUT_MASK)

#define NETC_SW_ENETC_TCCR_ARM_MASK              (0xC0000000U)
#define NETC_SW_ENETC_TCCR_ARM_SHIFT             (30U)
#define NETC_SW_ENETC_TCCR_ARM(x)                (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCCR_ARM_SHIFT)) & NETC_SW_ENETC_TCCR_ARM_MASK)
/*! @} */

/*! @name TCIER - Time capture interrupt enable register */
/*! @{ */

#define NETC_SW_ENETC_TCIER_TRANSMIT_MASK        (0x40000000U)
#define NETC_SW_ENETC_TCIER_TRANSMIT_SHIFT       (30U)
/*! TRANSMIT - Transmit interrupt */
#define NETC_SW_ENETC_TCIER_TRANSMIT(x)          (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCIER_TRANSMIT_SHIFT)) & NETC_SW_ENETC_TCIER_TRANSMIT_MASK)

#define NETC_SW_ENETC_TCIER_TIMEOUT_MASK         (0x80000000U)
#define NETC_SW_ENETC_TCIER_TIMEOUT_SHIFT        (31U)
/*! TIMEOUT - Timeout interrupt */
#define NETC_SW_ENETC_TCIER_TIMEOUT(x)           (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_TCIER_TIMEOUT_SHIFT)) & NETC_SW_ENETC_TCIER_TIMEOUT_MASK)
/*! @} */

