Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_NETC_SW_ENETC.h
#define NETC_SW_ENETC_ISIDKC0PF0CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC0PF0CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC0PF0CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF0CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF0CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC0PF1CR - Ingress stream identification key construction 0 payload field 1 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC0PF1CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF1CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF1CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC0PF1CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC0PF1CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF1CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF1CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC0PF1CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF1CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF1CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC0PF1CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF1CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF1CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC0PF1CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC0PF1CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF1CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF1CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC0PF2CR - Ingress stream identification key construction 0 payload field 2 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC0PF2CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF2CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF2CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC0PF2CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC0PF2CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF2CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF2CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC0PF2CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF2CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF2CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC0PF2CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF2CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF2CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC0PF2CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC0PF2CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF2CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF2CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC0PF3CR - Ingress stream identification key construction 0 payload field 3 configuration register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC0PF3CR_PFP_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_PFP_SHIFT     (0U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_PFP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF3CR_PFP_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF3CR_PFP_MASK)

#define NETC_SW_ENETC_ISIDKC0PF3CR_NUM_BYTES_MASK (0x1EU)
#define NETC_SW_ENETC_ISIDKC0PF3CR_NUM_BYTES_SHIFT (1U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_NUM_BYTES(x)  (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF3CR_NUM_BYTES_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF3CR_NUM_BYTES_MASK)

#define NETC_SW_ENETC_ISIDKC0PF3CR_BYTE_OFFSET_MASK (0x7F00U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_BYTE_OFFSET_SHIFT (8U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF3CR_BYTE_OFFSET_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF3CR_BYTE_OFFSET_MASK)

#define NETC_SW_ENETC_ISIDKC0PF3CR_FBMASK_MASK   (0x70000U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_FBMASK_SHIFT  (16U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_FBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF3CR_FBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF3CR_FBMASK_MASK)

#define NETC_SW_ENETC_ISIDKC0PF3CR_LBMASK_MASK   (0x700000U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_LBMASK_SHIFT  (20U)
#define NETC_SW_ENETC_ISIDKC0PF3CR_LBMASK(x)     (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC0PF3CR_LBMASK_SHIFT)) & NETC_SW_ENETC_ISIDKC0PF3CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC1OR - Ingress stream identification key construction 1 operational register */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC1OR_NUM_ENTRIES_MASK (0xFFFFU)
#define NETC_SW_ENETC_ISIDKC1OR_NUM_ENTRIES_SHIFT (0U)
#define NETC_SW_ENETC_ISIDKC1OR_NUM_ENTRIES(x)   (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1OR_NUM_ENTRIES_SHIFT)) & NETC_SW_ENETC_ISIDKC1OR_NUM_ENTRIES_MASK)

#define NETC_SW_ENETC_ISIDKC1OR_EN_MASK          (0x80000000U)
#define NETC_SW_ENETC_ISIDKC1OR_EN_SHIFT         (31U)
#define NETC_SW_ENETC_ISIDKC1OR_EN(x)            (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1OR_EN_SHIFT)) & NETC_SW_ENETC_ISIDKC1OR_EN_MASK)
/*! @} */

/*! @name ISIDKC1CR0 - Ingress stream identification key construction 1 configuration register 0 */
/*! @{ */

#define NETC_SW_ENETC_ISIDKC1CR0_VALID_MASK      (0x1U)
#define NETC_SW_ENETC_ISIDKC1CR0_VALID_SHIFT     (0U)
/*! VALID - Valid
 *  0b0..The entire key construction rule is not valid including any configuration payload key fields defined.
 *  0b1..The key construction rule is valid.
 */
#define NETC_SW_ENETC_ISIDKC1CR0_VALID(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_VALID_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_VALID_MASK)

#define NETC_SW_ENETC_ISIDKC1CR0_PORTP_MASK      (0x2U)
#define NETC_SW_ENETC_ISIDKC1CR0_PORTP_SHIFT     (1U)
/*! PORTP
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC1CR0_PORTP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_PORTP_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_PORTP_MASK)

#define NETC_SW_ENETC_ISIDKC1CR0_SPMP_MASK       (0x4U)
#define NETC_SW_ENETC_ISIDKC1CR0_SPMP_SHIFT      (2U)
/*! SPMP - Switch Port Masquerading (flag) Present
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC1CR0_SPMP(x)         (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_SPMP_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_SPMP_MASK)

#define NETC_SW_ENETC_ISIDKC1CR0_DMACP_MASK      (0x8U)
#define NETC_SW_ENETC_ISIDKC1CR0_DMACP_SHIFT     (3U)
/*! DMACP - Destination MAC (address) Present
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC1CR0_DMACP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_DMACP_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_DMACP_MASK)

#define NETC_SW_ENETC_ISIDKC1CR0_SMACP_MASK      (0x10U)
#define NETC_SW_ENETC_ISIDKC1CR0_SMACP_SHIFT     (4U)
/*! SMACP - Source MAC (address) Present.
 *  0b0..Not present
 *  0b1..Present
 */
#define NETC_SW_ENETC_ISIDKC1CR0_SMACP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_SMACP_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_SMACP_MASK)

#define NETC_SW_ENETC_ISIDKC1CR0_OVIDP_MASK      (0x20U)
#define NETC_SW_ENETC_ISIDKC1CR0_OVIDP_SHIFT     (5U)
/*! OVIDP - Outer VID Present
 *  0b0..Outer VLAN ID is not present in the key
 *  0b1..Outer VLAN ID is present in the key
 */
#define NETC_SW_ENETC_ISIDKC1CR0_OVIDP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_OVIDP_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_OVIDP_MASK)

#define NETC_SW_ENETC_ISIDKC1CR0_OPCPP_MASK      (0x40U)
#define NETC_SW_ENETC_ISIDKC1CR0_OPCPP_SHIFT     (6U)
/*! OPCPP - Outer PCP Present
 *  0b0..Outer VLAN header's PCP field not present in the key
 *  0b1..Outer VLAN header's PCP field present in the key
 */
#define NETC_SW_ENETC_ISIDKC1CR0_OPCPP(x)        (((uint32_t)(((uint32_t)(x)) << NETC_SW_ENETC_ISIDKC1CR0_OPCPP_SHIFT)) & NETC_SW_ENETC_ISIDKC1CR0_OPCPP_MASK)

